%%--- coding:utf-8 ---
-module(tb_heart_Tree).
-export([get/1,get_list/0]).
get(101)-> #{
    'name' => <<"练兵"/utf8>>
};
get(102)-> #{
    'name' => <<"利刃"/utf8>>
};
get(103)-> #{
    'name' => <<"铁蹄"/utf8>>
};
get(104)-> #{
    'name' => <<"筋弦"/utf8>>
};
get(105)-> #{
    'name' => <<"法杖"/utf8>>
};
get(106)-> #{
    'name' => <<"勤政"/utf8>>
};
get(107)-> #{
    'name' => <<"扩征"/utf8>>
};
get(108)-> #{
    'name' => <<"广植"/utf8>>
};
get(109)-> #{
    'name' => <<"兴农"/utf8>>
};
get(110)-> #{
    'name' => <<"深掘"/utf8>>
};
get(111)-> #{
    'name' => <<"领军"/utf8>>
};
get(112)-> #{
    'name' => <<"士气"/utf8>>
};
get(113)-> #{
    'name' => <<"军威"/utf8>>
};
get(114)-> #{
    'name' => <<"声势"/utf8>>
};
get(115)-> #{
    'name' => <<"魄力"/utf8>>
};
get(201)-> #{
    'name' => <<"珍宝"/utf8>>
};
get(202)-> #{
    'name' => <<"精工"/utf8>>
};
get(203)-> #{
    'name' => <<"节粮"/utf8>>
};
get(204)-> #{
    'name' => <<"析木"/utf8>>
};
get(205)-> #{
    'name' => <<"熔铁"/utf8>>
};
get(206)-> #{
    'name' => <<"援建"/utf8>>
};
get(207)-> #{
    'name' => <<"推演"/utf8>>
};
get(208)-> #{
    'name' => <<"监造"/utf8>>
};
get(209)-> #{
    'name' => <<"军备"/utf8>>
};
get(210)-> #{
    'name' => <<"锤炼"/utf8>>
};
get(301)-> #{
    'name' => <<"精粹"/utf8>>
};
get(302)-> #{
    'name' => <<"酒爵"/utf8>>
};
get(303)-> #{
    'name' => <<"门客"/utf8>>
};
get(304)-> #{
    'name' => <<"政绩"/utf8>>
};
get(305)-> #{
    'name' => <<"步兵校场"/utf8>>
};
get(306)-> #{
    'name' => <<"骑兵校场"/utf8>>
};
get(307)-> #{
    'name' => <<"持盾"/utf8>>
};
get(308)-> #{
    'name' => <<"骑甲"/utf8>>
};
get(309)-> #{
    'name' => <<"步兵营房"/utf8>>
};
get(310)-> #{
    'name' => <<"骑兵营房"/utf8>>
};
get(311)-> #{
    'name' => <<"矛阵"/utf8>>
};
get(312)-> #{
    'name' => <<"骑营"/utf8>>
};
get(313)-> #{
    'name' => <<"港运"/utf8>>
};
get(314)-> #{
    'name' => <<"佳质"/utf8>>
};
get(315)-> #{
    'name' => <<"开渠"/utf8>>
};
get(316)-> #{
    'name' => <<"植木"/utf8>>
};
get(317)-> #{
    'name' => <<"寻脉"/utf8>>
};
get(318)-> #{
    'name' => <<"兴民"/utf8>>
};
get(401)-> #{
    'name' => <<"星辰"/utf8>>
};
get(402)-> #{
    'name' => <<"幸运"/utf8>>
};
get(403)-> #{
    'name' => <<"惜银"/utf8>>
};
get(404)-> #{
    'name' => <<"冶神"/utf8>>
};
get(405)-> #{
    'name' => <<"惜粮"/utf8>>
};
get(406)-> #{
    'name' => <<"骑魂"/utf8>>
};
get(407)-> #{
    'name' => <<"盛名"/utf8>>
};
get(408)-> #{
    'name' => <<"书魄"/utf8>>
};
get(409)-> #{
    'name' => <<"惜木"/utf8>>
};
get(410)-> #{
    'name' => <<"珍灵"/utf8>>
};
get(411)-> #{
    'name' => <<"惜铁"/utf8>>
};
get(412)-> #{
    'name' => <<"挥师"/utf8>>
};
get(501)-> #{
    'name' => <<"幕僚"/utf8>>
};
get(502)-> #{
    'name' => <<"农耕"/utf8>>
};
get(503)-> #{
    'name' => <<"中级扩征"/utf8>>
};
get(504)-> #{
    'name' => <<"铁斧"/utf8>>
};
get(505)-> #{
    'name' => <<"中级兴农"/utf8>>
};
get(506)-> #{
    'name' => <<"英豪"/utf8>>
};
get(507)-> #{
    'name' => <<"炼银"/utf8>>
};
get(508)-> #{
    'name' => <<"中级广植"/utf8>>
};
get(509)-> #{
    'name' => <<"冶制"/utf8>>
};
get(510)-> #{
    'name' => <<"中级深掘"/utf8>>
};
get(511)-> #{
    'name' => <<"学艺"/utf8>>
};
get(601)-> #{
    'name' => <<"星辉"/utf8>>
};
get(602)-> #{
    'name' => <<"鸿运"/utf8>>
};
get(603)-> #{
    'name' => <<"摄魂"/utf8>>
};
get(604)-> #{
    'name' => <<"问道"/utf8>>
};
get(605)-> #{
    'name' => <<"破军"/utf8>>
};
get(606)-> #{
    'name' => <<"弓兵校场"/utf8>>
};
get(607)-> #{
    'name' => <<"方士校场"/utf8>>
};
get(608)-> #{
    'name' => <<"守位"/utf8>>
};
get(609)-> #{
    'name' => <<"列阵"/utf8>>
};
get(610)-> #{
    'name' => <<"弓兵营房"/utf8>>
};
get(611)-> #{
    'name' => <<"方士营房"/utf8>>
};
get(612)-> #{
    'name' => <<"弓部"/utf8>>
};
get(613)-> #{
    'name' => <<"法阵"/utf8>>
};
get(614)-> #{
    'name' => <<"军粮"/utf8>>
};
get(701)-> #{
    'name' => <<"智取"/utf8>>
};
get(702)-> #{
    'name' => <<"振武"/utf8>>
};
get(703)-> #{
    'name' => <<"无痕"/utf8>>
};
get(704)-> #{
    'name' => <<"观星"/utf8>>
};
get(705)-> #{
    'name' => <<"中级开渠"/utf8>>
};
get(706)-> #{
    'name' => <<"中级植木"/utf8>>
};
get(707)-> #{
    'name' => <<"中级寻脉"/utf8>>
};
get(708)-> #{
    'name' => <<"中级兴民"/utf8>>
};
get(709)-> #{
    'name' => <<"淬炼"/utf8>>
};
get(710)-> #{
    'name' => <<"步兵抗击"/utf8>>
};
get(711)-> #{
    'name' => <<"骑兵抗击"/utf8>>
};
get(712)-> #{
    'name' => <<"弓兵抗击"/utf8>>
};
get(713)-> #{
    'name' => <<"方士抗击"/utf8>>
};
get(714)-> #{
    'name' => <<"坚壁"/utf8>>
};
get(801)-> #{
    'name' => <<"访贤"/utf8>>
};
get(802)-> #{
    'name' => <<"疾驰"/utf8>>
};
get(803)-> #{
    'name' => <<"协力"/utf8>>
};
get(804)-> #{
    'name' => <<"力战"/utf8>>
};
get(805)-> #{
    'name' => <<"号令"/utf8>>
};
get(806)-> #{
    'name' => <<"清点"/utf8>>
};
get(807)-> #{
    'name' => <<"星降"/utf8>>
};
get(808)-> #{
    'name' => <<"强运"/utf8>>
};
get(809)-> #{
    'name' => <<"奇谋"/utf8>>
};
get(810)-> #{
    'name' => <<"悍勇"/utf8>>
};
get(811)-> #{
    'name' => <<"无暇"/utf8>>
};
get(812)-> #{
    'name' => <<"谋定"/utf8>>
};
get(813)-> #{
    'name' => <<"武威"/utf8>>
};
get(814)-> #{
    'name' => <<"智斗"/utf8>>
};
get(815)-> #{
    'name' => <<"绝智"/utf8>>
};
get(816)-> #{
    'name' => <<"无畏"/utf8>>
};
get(817)-> #{
    'name' => <<"设防"/utf8>>
};
get(818)-> #{
    'name' => <<"相轻"/utf8>>
};
get(819)-> #{
    'name' => <<"激斗"/utf8>>
};
get(820)-> #{
    'name' => <<"无懈"/utf8>>
};
get(821)-> #{
    'name' => <<"绝技"/utf8>>
};
get(901)-> #{
    'name' => <<"步兵专精"/utf8>>
};
get(902)-> #{
    'name' => <<"骑兵专精"/utf8>>
};
get(903)-> #{
    'name' => <<"弓兵专精"/utf8>>
};
get(904)-> #{
    'name' => <<"方士专精"/utf8>>
};
get(905)-> #{
    'name' => <<"冲突"/utf8>>
};
get(906)-> #{
    'name' => <<"英灵"/utf8>>
};
get(907)-> #{
    'name' => <<"显威"/utf8>>
};
get(908)-> #{
    'name' => <<"妙计"/utf8>>
};
get(909)-> #{
    'name' => <<"军魂"/utf8>>
};
get(910)-> #{
    'name' => <<"纷争"/utf8>>
};
get(911)-> #{
    'name' => <<"猩红升腾"/utf8>>
};
get(912)-> #{
    'name' => <<"碧绿升腾"/utf8>>
};
get(913)-> #{
    'name' => <<"绛紫升腾"/utf8>>
};
get(914)-> #{
    'name' => <<"金芒升腾"/utf8>>
};
get(915)-> #{
    'name' => <<"仇敌之血"/utf8>>
};
get(916)-> #{
    'name' => <<"上古神纹"/utf8>>
};
get(917)-> #{
    'name' => <<"至尊仙器"/utf8>>
};

get(_N) -> false.
get_list() ->
	[101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,201,202,203,204,205,206,207,208,209,210,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,401,402,403,404,405,406,407,408,409,410,411,412,501,502,503,504,505,506,507,508,509,510,511,601,602,603,604,605,606,607,608,609,610,611,612,613,614,701,702,703,704,705,706,707,708,709,710,711,712,713,714,801,802,803,804,805,806,807,808,809,810,811,812,813,814,815,816,817,818,819,820,821,901,902,903,904,905,906,907,908,909,910,911,912,913,914,915,916,917].
